# LWByClass

## Description
Sets the default document line weight to the line weight of the active class.&lt;BR&gt;

```pascal
PROCEDURE LWByClass;
```

```python

def vs.LWByClass():
    return None
```

## Remarks
Sets the global attributes to use the line weight of the default class.<BR>
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0
## Category
* Classes